-- phpMyAdmin SQL Dump
-- version 4.8.4
-- https://www.phpmyadmin.net/
--
-- Φιλοξενητής: 127.0.0.1
-- Χρόνος δημιουργίας: 25 Ιαν 2019 στις 12:45:47
-- Έκδοση διακομιστή: 10.1.37-MariaDB
-- Έκδοση PHP: 7.3.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Βάση δεδομένων: `pspi`
--

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `comments`
--

CREATE TABLE `comments` (
  `comment_id` int(11) NOT NULL,
  `username` text NOT NULL,
  `text` text NOT NULL,
  `rating` int(11) NOT NULL,
  `product_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Άδειασμα δεδομένων του πίνακα `comments`
--

INSERT INTO `comments` (`comment_id`, `username`, `text`, `rating`, `product_id`) VALUES
(1, 'Mary', 'Απίστευτα ωραίο', 5, 1),
(2, 'George', 'εχω το συγκεκριμένο επιτραπέζιο 2 χρόνια μέχρι την επέκταση 3,είναι ενα πολύ διασκεδαστικό επιτραπέζιο,παίζεται με πολλούς,έχει ευχάριστες εικόνες και είναι αρκετά ενδιαφέρον καθώς ειναι ανατρεπτικό, δεν θα το πρότεινα όμως εύκολα σε κάποιον να το αγοράσει,αν δεν τον ενδιαφερουν τα παιχνιδια ρόλων,έχω δυσκολευτεί πολύ να βρω παρέα που να ενδιαφέρεται να το παίξουμε καθώς είναι αρκετά δύσκολο για κάποιους, ενας γύρος δεν φτάνει για να το μαθει κάποιος και κατα πάσα πιθανότητα να το βαρεθεί απο τα 5 πρώτα λεπτά,η αλήθεια είναι οτι αξίζει να το μάθεις γιατί μετά έχει πολύ γέλιο ειναι ευχάριστο και δεν ξεκολλάς με τίποτα,δεν το βαριέσαι ποτέ γιατί έχει πάρα πολλές επεκτάσεις ,προς το παρόν στα ελληνικά μόνο 5, αλλα στα αγγλικά γίνεται ενα χάος απο το πόσες επεκτάσεις υπάρχουν', 3, 1),
(5, 'Jacob', 'Αρκετά βαρετό', 2, 1),
(6, 'Paul', 'Αρκετά μέτριο για παιχνίδι στρατηγικής', 3, 2),
(7, 'John', 'Καλό αλλά έχω παίξει και καλύτερα', 4, 2),
(8, 'Sam', 'Το καλύτερο παιχνίδι ever', 5, 3),
(9, 'Jim', 'Απλά τέλειο', 5, 3),
(10, 'Helen', 'Μία φορά το έπαιξα και το μετάνιωσα', 1, 4),
(11, 'Anna', 'Όχι κάτι το ιδιαίτερο', 2, 4),
(12, 'Gregory', 'Στηρίζεται κυρίως στην τύχη', 2, 5),
(13, 'Rafael', 'Πολύ εύκολες ερωτήσεις', 2, 6),
(14, 'Sophie', 'Απίστευτα τέλειο', 5, 8),
(15, 'Maria', 'Πολύ παιδικό και σαχλό παιχνίδι. Είναι καλό αν δεν έχεις τίποτα καλύτερο να κάνεις. Αλλά θα παίξεις με αυτό το πολύ τρεις ή τέσσερις φορές και μετά θα το βαρεθείς. Δεν αξίζει τα λεφτά του', 1, 7),
(16, 'Jim', 'Έχουν θράσος και μόνο που το αποκαλούν card game είναι προσβολή προς τα υπόλοιπα card game', 1, 12),
(17, 'Peter', 'Ίδιο στυλ με την αρχική έκδοση απλά έχεις επιπλέον κάρτες αλλά παραμένει αρκετά ωραίο', 4, 14),
(18, 'Philip', 'Ωραίο παιχνίδι για να περνάς την ώρα σου. Αλλά μόνο αυτο', 3, 10),
(19, 'Jennifer', 'Ίσως θα ήταν καλύτερο αν οι αντίπαλοι όριζαν την τύχη σου και όχι ο τροχός. Αλλά παρόλα αυτά είναι πολύ ωραίο παιχνίδι', 4, 10),
(20, 'Harry', 'Απλά άθλιο', 1, 10),
(21, 'Stephen', 'Ε εντάξει δεν είναι τόσο τέλειο όσο η σειρά αλλά δεν είναι και άσχημο', 3, 17),
(22, 'Julia', 'Πολύ ωραίο και σύντομο παιχνίδι', 4, 19),
(23, 'Christine', 'Ίσως το καλύτερο απο τα παιχνίδια σε μικρό κουτί. Για έως 4 παίχτες παίζεται με 16 κάρτες και για έως 8 με 32. Απλοί κανόνες, αυτοεπεξηγούμενες κάρτες και πάρα πολύ ποιοτικές σε υφή και εκτύπωση, όμορφο artwork, ωραία η ιστορία του κάθε χαρακτήρα. Ο μηχανισμός είναι να βγάλεις συμπέρασμα τι κάρτες έχουν οι αντίπαλοι για να τους εξουδετερώσεις και να πας το γράμμα αγάπης σου στη πριγκήπισσα, στους 8 παίχτες όμως η πλοκή παίρνει και άλλες τροπές! Μεγάλη επαναπαιξιμότητα, και φέρνει κοντά προχωρημένους και μη παίχτες επιτραπέζιων. Το συστήνω.', 5, 19),
(24, 'Jacob', 'Εντάξει top διασκεδαστικό παιχνίδι παρέας. Ατελείωτα βραδιά το καλοκαίρι, ενώνουμε 3 τραπέζια καθώς όσο περισσότερα τα άτομα μπαίνουν πιο πολλοί ρόλοι και το παιχνίδι απογειώνεται. Εμείς είμαστε γύρω στα 12-15 και ακόμα δεν έχουν μπει όλοι οι ρολόι όπως πχ δημοσιογράφος κλπ. Επικές κόντρες και τσακωμοί καθώς πρέπει να πεις και πολλά ψέματα για να πείσεις ότι είσαι απλός πολίτης, αλλά και παρά πολύ γέλιο.\r\n\r\nΤο παιχνίδι απαιτεί πονηριά και χειρισμό του λόγου και των κινήσεων με τέτοιο τρόπο ώστε να μην κινήσεις τις υποψίες όταν χρειάζεται. Έτσι επιστρατεύεις όλη σου την πονηριά, μορφασμούς και πειθω για να το καταφέρεις.\r\n\r\nΚατά τη γνώμη μου, για να γίνει ένα πραγματικά καλο παιχνίδι οι παίκτες πρέπει να είναι 17-18+, που έχουν αναπτύξει έννοιες όπως στρατηγική, υποκριτική, που χρειάζονται για να το γίνει ενα καλο παιχνίδι. Ιδανικό για μεγααααλες παρέες και προσοχή !!! Μόνο σε χώρους που επιτρέπεται η φασαρία γιατί πραγματικά γίνεται ένας χαμός. Και τι δεν έχουμε ακούσει εμείς που παίζουμε βραδιάτικα στην πλατεία !!\r\n\r\nΑξίζει πραγματικά!!! Καλή διασκέδαση !!\r\n\r\n', 5, 11),
(25, 'Lousie', 'Χρειάζεται ένας ουδέτερος παίχτης που θα αναλάβει τον ρόλο του συντονιστή, όπου θα επιβλέπει τις μυστικές ψηφοφορίες και την ομαλή ροή του παιχνιδιού. Αν δεν υπάρχει διαθέσιμος, αναλαμβάνει ο πρώτος που θα βγει ανενεργός. \r\n\r\nΕίναι παιχνίδι καρτών. \r\nΠαίζετε σε 3 φάσεις: \r\n1) Μέρα : Φανερή συζήτηση όλων των παιχτών για το ποιος παίχτης μπορεί να είναι μαφιόζος ή όχι. \r\n2) Ψηφοφορία : Ψηφίζουν όλοι οι παίχτες διαδοχικά, με τα μάτια κλειστά όλων των υπολοίπων παιχτών. Σκοπός να βγάλουν ανενεργό έναν παίχτη που εκτιμούν ότι είναι μαφιόζος. \r\n3) Νύχτα : Μυστική ψηφοφορία όλων των μαφιόζων, με τα μάτια κλειστά των υπολοίπων παιχτών. Σκοπός είναι να βγάλουν ανενεργό έναν αθώο πολίτη. \r\nΞανά από την αρχή.\r\n\r\nΚερδίζει όποια παράταξη εξουδετερώσει την αντίπαλη.\r\n\r\nΥπάρχουν κάποιες ιδιαιτερότητες ανάλογα τον χαρακτήρα που έχει ο κάθε παίχτης και κάρτες ενέργειας, όπου «ανακατεύουν» το παιχνίδι όπως ενεργοποίηση ενός ανενεργού παίχτη κτλ\r\n\r\nΟι οδηγίες του παιχνιδιού έχουν θέμα. Ποιο συγκεκριμένα ξεκινάει και εξηγεί το παιχνίδι σε πλήρη ανάπτυξη με όλους τους ρόλους, λόγο των πολλών ρόλων, διαβάζοντας τες η πρώτη σκέψη που σου έρχεται στο μυαλό είναι «δεν υπάρχει περίπτωση να παίξουμε αυτό το παιχνίδι». \r\nΧρειάστηκε να διαβάσω τις οδηγίες 3 φορές (σε διαφορετικές μέρες) για να καταλάβω τι περίπου γίνετε. \r\nΕπιπλέων οι κάρτες ενέργειας θα έπρεπε να αναλυθούν περισσότερο. \r\nΣυμβουλή : Στην αρχή διαβάστε μόνο για τους ρόλους για τους πρώτους 6-7 παίχτες και καθόλου για τους άλλους.\r\n\r\nΈνα ιδιαίτερο παιχνίδι χωρίς ταμπλό και πιόνια.', 3, 11),
(26, 'Brad', 'Για κάποιον ο οποίος δεν έχει ξαναπαίξει επιτραπέζιο ποτέ στην ζωή του, είναι το starting point σίγουρα διότι είναι απλό στους κανόνες του και νιώθεις ότι κάτι φτιάχνεις, όπως επίσης και έχει σημεία στα οποία μπορείς να γίνεις κακός με τους αντιπάλους σου αν θες. Αλλά για κάποιον ο οποίος ασχολείται τουλάχιστον 1 χρόνο με επιτραπέζια, υπάρχουν πολύ καλύτερα εκεί έξω αρκεί να ψάξει λίγο. Κατ\'εμε πλέον απλά πιάνει χώρο μιας και δεν το παίζουμε ποτε.', 2, 16),
(27, 'Brad', 'Απλοί κανόνες\r\nΜεγάλος χρόνος ολοκλήρωσης', 3, 18),
(28, 'James', 'ευχάριστο παιχνίδι για όλους,κάθε γύρος διαφορετικός και ανατρεπτικός,έχει γέλιο κρατάει λίγο το κάθε παιχνίδι αλλά ποτε δεν μένεις μόνο σε ένα, εμείς παίζουμε 3-4 περίπου,είναι εθιστικό γιατι θες να βγαίνεις νικητής το ταμπλό είναι λίγο ανούσιο καθώς ποτέ δεν βάζουμε τα όπλα εκει που πρέπει και κάποιες φορές ξεχνιόμαστε να μεταφέρουμε και τους παίκτες,αλλα κυλάει καλά το παιχνίδι. \r\n- \r\nτα χαρτάκια που έχει για τους παικτες είναι λίγα και θα αναγκαστείτε να εκτυπώσετε μερικά ( τα φτιάχνουμε εύκολα στο excel ),επίσης πρέπει να βρεις σε κάτι σταθερό να γράφεις πάνω και να κρύβεις ,πχ μικρά βιβλιαράκια,θα ήταν πιο πρακτικό αν φτιάχναν σκληρά ταμπλό τα οποιά να έχουν μόνιμα τα ονόματα/δωμάτια/όπλα και εσύ να βάζεις το αντίστοιχο χαρτί (ότι έχεις εύκαιρο)για να γράφεις.Γιαύτο και τα 3 αστεράκια.', 3, 20),
(29, 'Thomas', 'Αν περιμενετε το κλασικό Trivial pursuit που αγαπήσαμε θα απογοητευθείτε. Το μόνο κλασικό στο παιχνιδί είναι το ταμπλό του. Οι κατηγορίες ουσιαστικά δεν υπάρχουν καθώς πχ στην κατηγορία Ιστορία θα συναντήσετε ερωτήσεις για την εξαγορά της Yahoo απο την Verizon το 2016 ή του Instagram απο το Facebook, στην κατηγορία Γεωγραφία θα συναντήσετε ερωτήσεις για τους μκρους γαλαξίες που ονομάζονται νέφη του μαγγελάνου και στην κατηγορία αθλητισμός θα βρείτε ερωτήσεις για το Super Mario Bros.\r\n\r\nΕπίσης πολύ συχνά η ερωτήσεις δίνουν να διαλέξει ο ερωτούμενος ανάμεσα σε τρέις πιθανες απαντήσεις. Η κάνουν πρώτα μια δηλωσή και μετά ρωτάνε αν η παραπάνω δηλωση έιναι σωστή ή λάθος.\r\n\r\nΓενικά το παιχνίδι δίνει την εντύπωση προχειρότητας. Εϊναι σαν να κατηγοριοποιήσαν κάποιες ερωτήσεις απο αλλα trivial όπως να ναι και να της ανακατέψαν στη τύχη κατηγοριοποιοντάς τες στο περίπου, με το κλασικό πακέτο και ταμπλό να αποτελούν το δελεάρ.', 2, 6);

--
-- Δείκτες `comments`
--
DELIMITER $$
CREATE TRIGGER `update_product_rating` AFTER INSERT ON `comments` FOR EACH ROW UPDATE products
SET avg_rating = (SELECT AVG(rating) FROM comments WHERE product_id = NEW.product_id)
WHERE products.product_id = NEW.product_id
$$
DELIMITER ;

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `products`
--

CREATE TABLE `products` (
  `product_id` int(11) NOT NULL,
  `name` text NOT NULL,
  `description` text NOT NULL,
  `start_price` double NOT NULL,
  `end_price` double NOT NULL,
  `picture_name` text NOT NULL,
  `available` int(11) NOT NULL,
  `sold` int(11) NOT NULL,
  `category` text NOT NULL,
  `avg_rating` double NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Άδειασμα δεδομένων του πίνακα `products`
--

INSERT INTO `products` (`product_id`, `name`, `description`, `start_price`, `end_price`, `picture_name`, `available`, `sold`, `category`, `avg_rating`) VALUES
(1, 'Munchkin (Ελληνική Έκδοση)', 'Κατεβείτε στο μπουντρούμι. Σκοτώστε ό,τι και όποιον συναντήσετε. Μαχαιρώστε πισώπλατα τους φίλους σας και κλέψτε τα πράγματά τους. Αρπάξτε το θησαυρό και τρέξτε. Παραδεχτείτε το. Σας αρέσει…\r\nΑυτό το παιχνίδι σας βάζει στο κλίμα της εξερεύνησης… χωρίς τα βαρετά χαρακτηριστικά των παιχνιδιών ρόλων.\r\n\r\nΤο μόνο που πρέπει να κάνετε είναι να σκοτώσετε τέρατα και να αρπάζετε μαγικά αντικείμενα. Και τι αντικείμενα!\r\n\r\nΦορέστε το Κράνος με τα Κέρατα και τις Μπότες για Πολλές Κλωτσιές. Κρατήστε το Ραβδί «Ναπάλμ»… ή ίσως το Αλυσοπρίονο του Ολέθρου. Ξεκινήστε σφάζοντας τη Γλάστρα και την Σιχαμερή  Γλίτσα, και προχωρήστε έως τον Ραδιενεργό Δράκο.\r\nΓρήγορο και παρανοϊκό, το Munckin μπορεί να οδηγήσει τους παίκτες σε υστερία.\r\n\r\nΚαι, ενώ αυτοί γελάνε, εσείς μπορείτε να κλέψετε τα πράγματά τους.\r\n\r\nΓια 3-6 παίκτες (μπορούν να παίξουν και 2, αλλά όσο πιο πολλοί τόσο το καλύτερο). \r\nΔιάρκεια: περίπου μία ώρα.\r\nΤο παιχνίδι είναι στα Ελληνικά.\r\n\r\n\r\nΠεριεχόμενα:\r\n\r\n    168 κάρτες\r\n    οδηγίες', 14.99, 12.74, 'munchkin.jpg', 7, 20, 'Humor', 3.6),
(2, 'Bloodborne: The Card Game', 'Bloodborne: The Card Game is based on the Chalice Dungeons in the video game Bloodborne — the ever-changing labyrinths and tombs carved out by the Great Ones beneath the fallen city of Yharnam, where horrifying creatures reside. Players compete to kill monsters and take their blood.\r\n\r\nIn general, Bloodborne is a game about risk management with a bit of group think, inventory management/upgrades, and tactical play. You start with a hand of basic weapons, which you get to upgrade to improve your fighting combos and capabilities.\r\n\r\nΈνα παιχνίδι για 3-6 παίκτες, ηλικίας 14+.\r\nΜέση διάρκεια παιχνιδιού 40 λεπτά.\r\nΤο παιχνίδι είναι στα Αγγλικά.', 39.99, 33.99, 'bloodborne.jpg', 1, 4, 'Fantasy', 3.5),
(3, 'Sid Meier\'s Civilization: Νέα Εποχή', 'Το Sid Meier’s Civilization: Νέα Εποχή μετατρέπει την διάσημη σειρά παιχνιδιών για υπολογιστές σε ένα επιτραπέζιο παιχνίδι στρατηγικής. Οι παίκτες καθοδηγούν τα έθνη τους σε έναν αγώνα για εδάφη, τεχνολογία, και θαύματα που αλλάζουν τους κανόνες. Το να παίξετε ένα γύρο είναι τόσο απλό όσο το να παίξετε μια κάρτα, υπάρχει όμως βαθιά στρατηγική στο να επιλέξετε ποια από τις πέντε κάρτες σας να παίξετε. Με το στοιχείο του τυχαίου στους σκοπούς και έναν χάρτη που είναι διαφορετικός κάθε φορά, δυο παρτίδες σας δεν θα μοιάζουν ποτέ η μια με την άλλη!\r\n\r\n \r\n\r\nΈνα παιχνίδι για 2-4 παίκτες, ηλικίας 14+.\r\nΜέση διάρκεια παιχνιδιού 90 λεπτά.\r\nΤο παιχνίδι είναι στα Ελληνικά.', 49.99, 42.49, 'civilization.jpg', 3, 7, 'Civilization', 5),
(4, 'Mad Libs: The Game', 'Since its creation in 1958, Mad Libs has become the world\'s most popular word game, with over 125 million Mad Libs in print. And now, Looney Labs has turned it into Mad Libs: The Game-a party game that captures all the unexpected silliness of classic Mad Libs.\r\nEvery player is dealt Word Cards, which each feature a key word used as different parts of speech. Players use the Word Cards, along with the Sentence Card in play, to make the most appropriately inappropriate sentences possible! All players vote and the silliest sentence wins the round. The first player to win three rounds wins the game!', 24.99, 21.24, 'madlibs.jpg', 1, 5, 'Party', 1.5),
(5, 'Risk: Godstorm', 'Γνωρίστε τον κόσμο του Risk Godstorm, ένα κόσμο μύθων και θρύλων, ένα κόσμο όπου οι αρχαίες δοξασίες και οι φόβοι κυριαρχούν.\r\n\r\nΠολεμήστε σε όλα τα πέρατα της Γης αλλά και στις σκοτεινές περιοχές κάτω από την επιφάνειά της.\r\n\r\nΤιθασεύστε πρωταρχικές δυνάμεις για να χτυπήσετε του αντιπάλους σας.\r\n\r\nΕλέγξτε πέντε αρχαίους πολιτισμούς – Έλληνες, Κέλτες, Βαβυλώνιους, Σκανδιναβούς και Αιγυπτίους – σε μία ήπειρο όπου μαίνεται από μάχες που θα αποφασίσουν ποιος πολιτισμός θα είναι ο τελικός κυρίαρχος. Και να είστε βέβαιοι ότι οι θεοί δεν θα παρακολουθήσουν απαθείς αυτό τον πόλεμο.\r\n\r\nΤο Risk Godstorm είναι ένα επιτραπέζιο παιχνίδι για 2-5 παίκτες ηλικίας 10+. \r\nΜέση διάρκεια παιχνιδιού 120 λεπτά.\r\nΤο παιχνίδι είναι στα Αγγλικά.\r\n\r\n\r\nΠεριεχόμενα:\r\n\r\n    1 ταμπλό \'Ancient Earth\'\r\n    1 ταμπλό \'Underworld\'\r\n    5 διαφορετικοί αρχαίοι στρατοί\r\n    5 σετ θεών\r\n    5 κάρτες πάνθεον\r\n    66 κάρτες θαυμάτων\r\n    44 κάρτες επικράτειας\r\n    12 ναοί\r\n    60 δείκτες πίστης\r\n    1 κάρτα αναφοράς\r\n    1 δείκτης εποχής\r\n    5 δείκτες σειράς\r\n    5 δείκτες πανούκλας\r\n    1 δείκτης βυθισμένης Ατλαντίδας\r\n    1 δείκτης δίνης\r\n    10 ζάρια\r\n    1 φυλλάδιο με οδηγίες', 44.99, 38.24, 'risk.jpg', 1, 3, 'War', 2),
(6, 'Trivial Pursuit Classic Edition', 'Gather your friends to play the trivia game that started It all! The Classic Edition of this Trivial Pursuit Game is the same gameplay you know and love, only with a 1980\'s retro appearance! Featuring classic gameplay and gameboard, this game contains 2,400 questions in 6 categories: Geography, Entertainment, History, Art and Literature, Science and Nature, and Sports and Leisure. Players move around the board answering questions. When a player lands on a category space, they\'ll earn the corresponding colored wedge if they answer the question correctly. The first player to collect 6 different colored wedges and answer a final question correctly wins!\r\n\r\nIncludes gameboard, 400 cards, 1 die, 6 wedge holders, and 36 wedges.\r\n\r\n• Features classic Trivial Pursuit gameplay\r\n• 2,400 trivia questions from traditional game categories\r\n• Includes retro looking gameboard\r\n\r\n• Ages 16 and up\r\n• For 2 to 6 players.', 29.99, 25.49, 'trivia.jpg', 2, 6, 'Trivia', 2),
(7, 'Ταξιδεύοντας Στην Ελλάδα', 'Η σειρά επιτραπέζιων παιχνιδιών Ταξιδεύοντας αποτελεί μια διαχρονική αξία στο χώρο των επιτραπέζιων παιχνιδιών, αφού προσφέρει γνώσεις και διασκεδάζει μικρούς και μεγάλους! Ανακάλυψε απίθανα μέρη. Μάθε την ιστορία, την πολιτιστική κληρονομιά, τα αξιοθέατα κάθε τόπου. Τα παιχνίδια περιέχουν πίνακες-χάρτες με πόλεις-σταθμούς, κάρτες- πόλεων και κάρτες-ερωτήσεις.', 18, 15.3, 'ταξιδεύοντας.jpg', 2, 3, 'Trivia', 1),
(8, 'Dixit (Νέα Έκδοση)', 'Πέντε εικόνες ανοίγουν. Έχουν όλες κάτι κοινό: μια αινιγματική πρόταση. Μια όμως  από τις πέντε ανήκει στον αφηγητή. \r\n\r\nΟι παίκτες θα πρέπει να επιστρατεύσουν τη διορατικότητα και τη λογική τους για να τη βρούνε, αποφεύγοντας ταυτόχρονα τις παγίδες των συμπαικτών τους.\r\n\r\nΤο Dixit είναι ένα ευχάριστο αλλά και συναρπαστικό παιχνίδι γεμάτο εκπλήξεις για την παρέα αλλά και όλη την οικογένεια.\r\n\r\nΈνα επιτραπέζιο παιχνίδι για 3 εώς 6 παίκτες ηλικίας 8+. \r\nΜέση διάρκεια 30 λεπτά.\r\nΤο παιχνίδι είναι στα Ελληνικά.\r\n\r\n\r\nΠεριεχόμενα:\r\n\r\n     84 κάρτες\r\n    1 ταμπλό\r\n    6 ξύλινα κουνέλια\r\n    36 πλακίδια ψήφων\r\n    κανόνες', 29.99, 25.49, 'dixit_new.jpg', 4, 8, 'Party', 5),
(9, 'Dixit Odyssey (Νέα Έκδοση)', 'Με το Dixit Odyssey, ανακαλύψτε και πάλι όλη τη μαγεία του Dixit, του πιο πολυβραβευμένου παιχνιδιού των τελευταίων δυο χρόνων: αποκρυπτογραφήστε τα μυστικά των εικόνων, αποφύγετε τις παγίδες που σας βάζουν οι αντίπαλοί σας, και αφήστε τη φαντασία σας να σας πάρει μακριά! Με τη νέα αυτή έκδοση, παίξτε έως και με 12 παίκτες, ανακαλύψτε νέες παραλλαγές των κανόνων, και κατακτήστε νέους μαγευτικούς κόσμους!\r\n\r\n\r\nΔεν είναι απαραίτητα τα άλλα παιχνίδια Dixit για να παίξετε. Μπορείτε όμως να συνδυάσετε αυτό το κουτί με τα άλλα παιχνίδια της σειράς Dixit.\r\n\r\n\r\nΈνα παιχνίδι για 3-12 παίκτες, ηλικίας 8+.\r\n\r\nΜέση διάρκεια παιχνιδιού 30 λεπτά.\r\n\r\nΤο παιχνίδι είναι στα Ελληνικά.\r\n\r\n\r\nΠεριεχόμενα:\r\n\r\n\r\n    1 ταμπλό βαθμολόγησης\r\n    84 κάρτες\r\n    12 ταμπλό ψηφοφορίας\r\n    24 δείκτες ψήφου\r\n    12 ξύλινα κουνέλια\r\n    κανόνες', 29.99, 25.49, 'dixit_odyssey.jpg', 5, 4, 'Party', 0),
(10, 'Twister', 'Τεντώσου, ισορρόπησε και κρατήσου εκεί! Πρόσεξε όμως: αν πέσεις βγαίνεις έξω!! Tο γνωστό επιτραπέζιο παιχνίδι που σε δένει κόμπο! - Παίζεται με 2 και περισσότερους παίκτες. Απαιτείται συναρμολόγηση απο ενήλικα.', 19.99, 16.99, 'twister.jpg', 2, 3, 'Party', 2.666666666),
(11, 'Παλέρμο: Το Μεγάλο Ξεκαθάρισμα', 'Στην ήσυχη πόλη του Παλέρμο μια σειρά από δολοφονίες διαταράσσουν την ηρεμία των πολιτών.\r\n\r\nΗ Μαφία έχει απλώσει τα δίχτυα της και κάθε βράδυ ο αριθμός των θυμάτων μεγαλώνει. Οι πολίτες του Παλέρμο πασχίζουν να ανακαλύψουν τους ενόχους. Όμως ποιον να εμπιστευτούν; Κανείς δεν ξέρει ποιος μπορεί να κρύβεται από πίσω. Ένα είναι σίγουρο όμως: Όλοι παίζουν κάποιο ρόλο σε αυτή την ιστορία!\r\n\r\n\r\nΤο “Παλέρμο: Το Μεγάλο Ξεκαθάρισμα” είναι μια νέα εκδοχή του γνωστού παιχνιδιού παρέας στο οποίο οι αθώοι πολίτες προσπαθούν να ανακαλύψουν τους μαφιόζους ανάμεσα τους. Σε αντίθεση όμως με άλλες εκδόσεις του παιχνιδιού, εδώ ΟΛΟΙ οι αθώοι πολίτες μπορούν να έχουν ένα δικό τους ρόλο με μια κρυφή ιδιότητα που θα τους βοηθήσει να ανακαλύψουν τους ενόχους. Επιπλέον, κάρτες ενεργειών δίνουν νέες δυνατότητες για συλλογή πληροφοριών, μπλόφες και αποκαλύψεις ενόχων! Όταν όμως κανείς δε μπορεί να εμπιστευτεί κανέναν, πόσο αποτελεσματικά θα μπορέσετε να τα αξιοποιήσετε όλα αυτά;\r\n\r\n\r\n\r\nΈνα παιχνίδι για 7 έως 20 παίκτες, ηλικίας 14+.\r\n\r\nΜέση διάρκεια παιχνιδιού 45 λεπτά. \r\nΤο παιχνίδι είναι στα Eλληνικά.\r\n\r\n\r\nΠεριεχόμενα:\r\n\r\n    30 κάρτες ρόλων\r\n    80 κάρτες ενεργειών\r\n    1 βοήθημα συντονιστή\r\n    1 σημειωματάριο\r\n    1 Αλμανάκ\r\n    κανόνες', 14.99, 12.74, 'palermo.jpg', 4, 7, 'Party', 4),
(12, 'Ιστορίες Μυστηρίου', '50 ιστορίες μυστηρίου, 31 εγκλήματα, 49 πτώματα, 11 δολοφόνοι, 12 αυτοκτονίες και ένα θανάσιμο γεύμα.\r\nΠώς συνέβησαν όλα αυτά;\r\nΟι ιστορίες μυστηρίου είναι πονηρές, μακάβριες, σκοτεινές ιστορίες-γρίφοι.\r\nΛύστε τους γρίφους!\r\n\r\nΚατασκευάστε το πάζλ του κάθε γεγονότος, κομμάτι – κομμάτι, κάνοντας ερωτήσεις, υποθέτοντας και αναλύοντας τα στοιχεία – μόνοι ή με φίλους. Είναι ένα ελαφρώς ανατριχιαστικό αλλά πολύ διασκεδαστικό παιχνίδι σκέψης, το οποίο δεν θα πρέπει να λείπει από κανένα πάρτι – και το οποίο πολύ γρήγορα θα σας μαγνητίσει!\r\n\r\nΈνα επιτραπέζιο παιχνίδι για 2+ παίκτες, ηλικίας 16+. \r\nΜέση διάρκεια 20\' +.\r\nΤο παιχνίδι είναι στα Ελληνικά.\r\n\r\n\r\nΠεριεχόμενα:\r\n\r\n    50 κάρτες\r\n    οδηγίες', 9.99, 8.49, 'ιστορίες_μυστηρίου.jpg', 5, 4, 'Mystery', 1),
(13, 'Ιστορίες Μυστηρίου 2', 'Είναι πιο σκοτεινές. Είναι πιο μακάβριες. Είναι πιο πονηρές. Είναι οι Ιστορίες Μυστηρίου 2 – 50 ακόμα πιο μαύρες ιστορίες, για όσους δεν χορταίνουν τα μυστήρια.\r\nΛύστε τους γρίφους! Κατασκευάστε το πάζλ του κάθε γεγονότος, κομμάτι – κομμάτι, κάνοντας ερωτήσεις, υποθέτοντας και αναλύοντας τα στοιχεία – μόνοι ή με φίλους. Είναι ένα ελαφρώς ανατριχιαστικό αλλά πολύ διασκεδαστικό παιχνίδι σκέψης, το οποίο δεν θα πρέπει να λείπει από κανένα πάρτι – και το οποίο πολύ γρήγορα θα σας μαγνητίσει!\r\n\r\nΈνα επιτραπέζιο παιχνίδι για 2+ παίκτες, ηλικίας 16+.\r\nΜέση διάρκεια 2\' - 222\'.\r\nΤο παιχνίδι είναι στα Ελληνικά.\r\n\r\n\r\nΠεριεχόμενα:\r\n\r\n    50 κάρτες\r\n    κανόνες', 9.99, 8.49, 'ιστορίες_μυστηρίου_2.jpg', 3, 4, 'Mystery', 0),
(14, 'Munchkin 2 Αφύσικο Τσεκούρι', 'Το Munchkin ξαναχτυπά!\r\n\r\n112 επιπλέον κάρτες για το παιχνίδι όπου μαχαιρώνετε πισώπλατα τους φίλους σας, σκοτώνετε τέρατα και παίρνετε τους θησαυρούς τους.\r\n\r\nΠαίξτε μία νέα φυλή: τα τρομερά Ορκ! Αντιμετωπίστε τέρατα όπως το Διιστάμενον και τον Δαίμονα με τα 1000 Πλοκάμια. Εξοπλιστείτε με τρομερές πανοπλίες, όπως το Τσίγκινο Σωβρακάκι με Καρφιά. Πάρτε συμμάχους με το μέρος σας, όπως τον Δράκου Ώμου. Χειριστείτε πανίσχυρα όπλα όπως τον Ζωμό Δρυίδη, το Ευλογημένο Σφυρί του Αγίου Βαράτε και φυσικά, το φοβερό Αφύσικο Τσεκούρι… και δείξτε τους ποιος είναι ο πραγματικός Munchkin. Περιέχονται και πέντε κενές κάρτες για να προσθέσετε τα δικά σας παρανοϊκά τέρατα και εξωφρενικούς κανόνες.\r\n\r\nΑυτή είναι μία επέκταση για το παιχνίδι Munchkin. Δεν είναι αυτόνομο παιχνίδι.\r\n\r\nΈνα παιχνίδι για 3-6 παίκτες,  ηλικίας 13+.\r\n\r\nΜέση διάρκεια παιχνιδιού 45 λεπτά.\r\n\r\nΤο παιχνίδι είναι στα Ελληνικά.\r\n\r\nΠεριεχόμενα:\r\n\r\n\r\n    112 έγχρωμες κάρτες', 12.99, 11.04, 'munchkin_2.jpg', 1, 6, 'Humor', 4),
(15, 'Monopoly: Classic', 'Γρήγορο επιτραπέζιο παιχνίδι αγοραπωλησίας ακινήτων! Με νέα πιόνια!\r\nΑγόρασε, πούλησε, ονειρέψου και κέρδισε!\r\nΟδήγησε τους αντιπάλους σου σε χρεοκοπία για να τους νικήσεις!\r\n\r\nΠεριεχόμενα:\r\nΤαμπλό παιχνιδιού\r\n8 πιόνια\r\n28 κάρτες τίτλων ιδιοκτησίας\r\n16 κάρτες εντολών\r\n16 κάρτες αποφάσεων\r\n32 σπίτια\r\n12 ξενοδοχεία\r\n2 ζάρια\r\nΔεσμίδα χαρτονομισμάτων\r\nΟδηγίες παιχνιδιού\r\n\r\nΚατάλληλο για ηλικίες από 8+ ετών και για 2-6 παίκτες.', 24.99, 21.24, 'monopoly_classic.jpg', 5, 12, 'Economic', 0),
(16, 'Monopoly: Gamer', 'Η νέα έκδοση της Monopoly θα σε συναρπάσει! Πλέον δε χρειάζεται να επιλέξεις τα κλασσικά πιόνια αλλά χαρακτήρες του Super Mario. Παίξε σαν Mario, Princess Peach, Yoshi και Donkey Kong. Κάθε παίκτης που αγοράζει ιδιοκτησίες, συλλέγει Νομίσματα και νικάει αρχηγούς κερδίζει πόντους. Ο παίκτης με το υψηλότερο σκορ είναι ο νικητής.Περιλαμβάνει: ταμπλό, 4 Nintendo Χαρακτήρες πιόνια, 4 κάρτες Χαρακτήρων, 4 κάρτες Υπενθύμισης, 8 κάρτες Αρχηγών, 16 Τίτλοι ιδιοκτησίας, 1 ζάρι, 1 ζάρι Αναβάθμισης, 90 νομίσματα και οδηγίες.', 29.99, 25.49, 'monopoly_gamer.jpg', 3, 8, 'Economic', 2),
(17, 'Game Of Thrones: Ο Σιδερένιος Θρόνος', 'O Βασιλιάς Ρόμπερτ είναι νεκρός. Οι Μεγάλοι Οίκοι των Επτά Βασιλείων βρίσκονται στα πρόθυρα του πολέμου, καθένας αποφασισμένος να διεκδικήσει με κάθε τρόπο την κυριαρχία ή να καταρρεύσει. Οι Οίκοι Μπαράθηον, Λάννιστερ, Σταρκ, Ταργκάρυεν και Ταϊρέλ συναγωνίζονται για το υπέρτατο έπαθλο στο Γουέστερος: τον Σιδερένιο Θρόνο. Ποιος θα τον κερδίσει;\r\n\r\nΈνα επιτραπέζιο παιχνίδι για 3-5 παίκτες ηλικίας 16+.\r\nΜέση διάρκεια παιχνιδιού 45 λεπτά.\r\nΤο παιχνίδι είναι στα Ελληνικά.', 49.99, 42.49, 'game_of_thrones.jpg', 3, 4, 'Fantasy', 3),
(18, 'Stratego Original (New Edition)', 'A Napoleonic theme where two armies, complete with spies, battle to win!\r\nFor 2 players, ages 8 & up\r\nThe classic game of battlefield strategy\r\nDevise a plan to capture your opponent\'s flag\r\nThe classic game of battlefield strategy\r\nDevise a plan to capture your opponent\'s flag\r\nA Napoleonic theme where two armies, complete with spies, battle to win!\r\nFor 2 players, ages 8 & up\r\n\r\nΠεριέχει και ελληνικές οδηγίες.', 31.99, 27.19, 'stratego.jpg', 3, 5, 'Strategy', 3),
(19, 'Love Letter Premium', 'Πολλοί νεαροί άνδρες (και μερικοί όχι και τόσο νεαροί) επιθυμούν να φλερτάρουν την πριγκίπισσα. Δυστυχώς, εκείνη έχει κλειστεί στο δωμάτιό της στο παλάτι, και πρέπει να βασιστείτε σε άλλους για να της δώσουν το γράμμα σας. Θα τα καταφέρετε;\r\n\r\nΤο Love Letter είναι ένα παιχνίδι ρίσκου, αποκλεισμών και τύχης. Προσπαθήστε να φτάσει το γράμμα σας στα χέρια της Πριγκίπισσας Ανέτ, εμποδίζοντας τα γράμματα των υπολοίπων. Οι ισχυρές κάρτες σας δίνουν το πλεονέκτημα από νωρίς, γίνεστε όμως στόχος. Αν πάλι βασιστείτε σε αδύναμες κάρτες, το γράμμα σας μπορεί να καταλήξει στο τζάκι!\r\n\r\nΤο Love Letter Premium έχει κάρτες από πιο σκληρό χαρτί, το κλείσιμο του κουτιού είναι μαγνητικό και οι καρδιές που διεκδικούν οι παίκτες είναι ξύλινες.\r\n\r\nΈνα επιτραπέζιο παιχνίδι για 2-4 παίκτες, ηλικίας 10+.\r\n\r\nΜέση διάρκεια παιχνιδιού 20 λεπτά.\r\n\r\nΤο επιτραπέζιο είναι στα ελληνικά.\r\n\r\n\r\nΠεριεχόμενα:\r\n\r\n\r\n    32 κάρτες χαρακτήρων\r\n    8 κάρτες σύνοψης\r\n    23 δεικτες αγάπης\r\n    1 δείκτης γελωτοποιού\r\n    κανόνες', 11.99, 10.49, 'love_letter.jpg', 7, 6, 'Deduction', 4.5),
(20, 'Cluedo Το Κλασικό Παιχνίδι Μυστηρίου (Νέα Έκδοση)', 'Ήρθε το ανανεωμένο Cluedo.\r\n\r\nΤο μυστήριο που τόσο σας αρέσει να λύνετε ξανά και ξανά τώρα με περισσότερη αγωνία.Είναι ένα πάρτι με τους συνήθεις ύποπτους και τον οικοδεσπότη να δολοφονείται. Αυτή τη φορά κανείς δεν περιμένει υπομονετικά για απαντήσεις. Ο δράστης απειλεί να χτυπήσει ξανά και οι κατηγορίες δίνουν και παίρνουν. Κάνε και εσύ μερικές και αποκάλυψε το σκάνδαλο για το οποίο σιγοψιθυρίζουν όλοι.', 21.99, 18.69, 'cluedo.jpg', 2, 7, 'Deduction', 3);

--
-- Ευρετήρια για άχρηστους πίνακες
--

--
-- Ευρετήρια για πίνακα `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`comment_id`),
  ADD KEY `product_id` (`product_id`);

--
-- Ευρετήρια για πίνακα `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`product_id`);

--
-- AUTO_INCREMENT για άχρηστους πίνακες
--

--
-- AUTO_INCREMENT για πίνακα `comments`
--
ALTER TABLE `comments`
  MODIFY `comment_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=30;

--
-- AUTO_INCREMENT για πίνακα `products`
--
ALTER TABLE `products`
  MODIFY `product_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- Περιορισμοί για άχρηστους πίνακες
--

--
-- Περιορισμοί για πίνακα `comments`
--
ALTER TABLE `comments`
  ADD CONSTRAINT `comments_ibfk_1` FOREIGN KEY (`product_id`) REFERENCES `products` (`product_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
